// Дано ціле число (ввести через 'prompt'). З'ясувати, чи просто воно (простим називається число, більше 1, що не має інших дільників, крім 1 і себе).

let n = +prompt("Пожалуйста, введите число", "97");
let prime_number = true;

if (n > 1) {
    for (let i = 2; i < n; i++) {
        if (n % i === 0) {
            console.log(`${n} не является простым числом, так как делится на ${i}`);
            prime_number = false;
            break;
        }
    }

    if (prime_number) {
        console.log(`${n} является простым числом`);
    }
}
